In [1]:
import pandas as pd
import numpy as np

In [46]:
import mysql.connector


conn = mysql.connector.connect(host='localhost',port=3307,
                                         database='FlightDataBase',
                                         user='root',
                                         password='rootuser')

In [47]:

print(conn)

<mysql.connector.connection_cext.CMySQLConnection object at 0x000002448FBD5070>

In [48]:
 cur = conn.cursor()

In [49]:
cur.execute("show tables")

In [50]:
for table in cur:
    print(table)

('aircraft',)
('aircraftinstance',)
('aircraftmanufacturer',)
('aircraftseat',)
('airport',)
('baggageid',)
('booking',)
('client',)
('direction',)
('flight',)
('flight_status',)
('flightaircraftinstance',)
('schedule',)
('states',)
('travelclass',)

### Insertion into states table

In [51]:
path = "D:/DE_classes/repos/Futurense-mysql/sql/Airline/USA_states_refined.csv"

dir_df = pd.read_csv(path,usecols=['iata_country_code','name'])

for idx,data in dir_df.iterrows():
    cur.execute("insert into states values(%s,%s)",tuple(data))

In [52]:
conn.commit()

### Insertion into travelclass table

In [53]:
path = "D:/DE_classes/repos/Futurense-mysql/sql/Airline/tbl_travel_class.csv"

travelclass_df = pd.read_csv(path,usecols=["travelclass_id","name",'description'])
travelclass_df.replace(to_replace={1:'B',2:'E'},inplace=True)




for idx,data in travelclass_df.iterrows():
    cur.execute("insert into travelclass(travel_class_id,name,description) values(%s,%s,%s)",tuple(data))
    
conn.commit()

### Insert into aircraftmanufacturer table

In [54]:
path = "D:/DE_classes/repos/Futurense-mysql/sql/Airline/tbl_mft_data.csv"

aircraft_manufac_df = pd.read_csv(path,usecols=['mft_id','manufacturer'])
aircraft_manufac_df

for idx,data in aircraft_manufac_df.iterrows():
    cur.execute("insert into aircraftmanufacturer(aircraft_manufacturer_id,name) values(%s,%s)",(data[1],data[0]))

In [55]:
conn.commit()

### Insert into aircraft table

In [56]:
path = "D:/DE_classes/repos/Futurense-mysql/sql/Airline/tbl_aircraft_323.csv"

aircraft_df = pd.read_csv(path,usecols=['model','seats','mft_id','aircraft_id'])
#aircraft_df
#,usecols=['aircraft_id','aircraft_manufacturer_id','model','seats']
for idx,data in aircraft_df.iterrows():
    #print(tuple(data))
    cur.execute("insert into aircraft(model,seats,aircraft_manufacturer_id,aircraft_id)values(%s,%s,%s,%s)",tuple(data))
    
conn.commit()

## insert into airports table

In [57]:
path = "D:/DE_classes/repos/Futurense-mysql/sql/Airline/tbl_airports.csv"

airports_df = pd.read_csv(path,usecols=['IATA_CODE','AIRPORT','CITY','STATE'])
airports_df
#,usecols=['aircraft_id','aircraft_manufacturer_id','model','seats']
for idx,data in airports_df.iterrows():
#     print(tuple(data))
    cur.execute("insert into airport(iata_airport_code,name,city,iata_state_code)values(%s,%s,%s,%s)",tuple(data))
    
conn.commit()

## insert into directions table

In [58]:
path = "D:/DE_classes/repos/Futurense-mysql/sql/Airline/tbl_directions_new.csv"

directions_df = pd.read_csv(path,usecols=['org_airport','dest_airport','distance'])

print(directions_df.shape)
directions_df = directions_df.drop_duplicates(subset=['org_airport','dest_airport'])
print(directions_df.shape)

# updated_df = directions_df.drop_duplicates(subset=['org_airport','dest_airport'])
# updated_df
# #,usecols=['aircraft_id','aircraft_manufacturer_id','model','seats']


for idx,data in directions_df.iterrows():
#     print(tuple(data))
    cur.execute("insert into direction(origin_iata_airport_code,dest_iata_airport_code,distance) values(%s,%s,%s)",tuple(data))
    
conn.commit()

(4645, 3)
(4579, 3)

# insert into aircraftseat table

In [59]:
path = "D:/DE_classes/repos/Futurense-mysql/sql/Airline/tbl_aircraft_seats_new.csv"

aircraft_seats_df = pd.read_csv(path,usecols=['aircraft_id','seat_id','travelclass_id'])
aircraft_seats_df


for idx,data in aircraft_seats_df.iterrows():
    try:
        cur.execute("insert into aircraftseat(aircraft_id,seat_id,travel_class_id) values(%s,%s,%s)",(data[0],data[1],data[2]))
    except:
        print(data)

In [60]:
conn.commit()

# insert into flightstatus table

In [61]:
path = "D:/DE_classes/repos/Futurense-mysql/sql/Airline/flight_status.csv"

flight_status = pd.read_csv(path)
flight_status.at[11,'name']='Past flight'

for idx,data in flight_status.iterrows():
    cur.execute("insert into flight_status(flight_status_id,name) values(%s,%s)",((data[0],data[1])))

conn.commit()

# insert into client table

In [62]:
path = "D:/DE_classes/repos/Futurense-mysql/sql/Airline/clients_3lacs.csv"

clients = pd.read_csv(path,usecols=lambda x: x != 'Unnamed: 0')
clients = clients.drop(0)

clients

,client_id,first_name,middle_name,last_name,phone,email,passport,iata_country_code
1,1,Zachary,Owens,Johnson,473-739-2089x3405,spencerdowns@hotmail.com,76247149,MO
2,2,Gary,Roberts,Crane,0578749554,margaret31@rodriguez.com,38383823,MI
3,3,Crystal,Carlson,Harmon,(618)496-3918x8558,marywright@gmail.com,33462431,PA
4,4,Misty,Johnson,Savage,(538)083-6394,bharris@yahoo.com,21317682,DE
5,5,Paul,Woods,Ford,+1-138-947-6518,holly79@gmail.com,20693602,NH
...,...,...,...,...,...,...,...,...
299995,299995,Joel,Neal,Hogan,(663)173-7504x3432,scott14@reyes-martinez.biz,32100679,ND
299996,299996,Sandra,Edwards,Case,400-751-0955x021,brianaperez@clark.com,83568442,CO
299997,299997,Abigail,Thomas,Wilson,(863)964-8772x157,heather37@hotmail.com,36541737,MO
299998,299998,Jasmine,Brock,Ford,439.518.9989,mcdonaldkatie@harris.net,34279106,NC
299999,299999,Kristen,Davis,Porter,+1-959-824-5352x78439,ulee@jordan.com,99509620,OR

In [63]:
clients.shape

(299999, 8)

In [64]:
for idx,data in clients.iterrows():
    data = tuple(data.to_list())
    cur.execute("insert into client(client_id,first_name,middle_name,last_name,phone,email,passport,iata_state_code)values(%s,%s,%s,%s,%s,%s,%s,%s)",data)

In [65]:
conn.commit()

## insert into schedule table

In [66]:
path = "D:/DE_classes/repos/Futurense-mysql/sql/Airline/tbl_schedule_ev.csv"

schedule = pd.read_csv(path,usecols=lambda x: x!= 'Unnamed: 0')
#schedule.rename(columns={"Unnamed: 0":"schedule_id"},inplace=True)
#schedule = schedule.drop(0)
schedule.shape

# schedule['DEPARTURE_TIME'] = schedule['DEPARTURE_TIME'].replace('n:an','10:00')
# schedule['DEPARTURE_TIME'] = schedule['DEPARTURE_TIME'].apply(lambda x:str(pd.to_datetime(x,format='%H:%M'))).split()[1]



for idx,data in schedule.iterrows():
    data = tuple(data)
    #print(data)
    try:
        cur.execute("insert into schedule(departure_date,schedule_id,origin_iata_airport_code,dest_iata_airport_code,departure_time_gmt,arrival_time_gmt) values(%s,%s,%s,%s,%s,%s)",data)
    except:
        print(idx,data[1])
conn.commit()

182 183
220 221
1492 1493
1545 1546
3067 3068
3122 3123
4591 4592
4641 4642
6149 6150
6211 6212
9252 9253
9300 9301
12294 12295
12349 12350
14798 14799
14842 14843
16288 16289
16342 16343
19372 19373
19424 19425
20908 20909
20969 20970
22528 22529
22585 22586
26391 26392
26447 26448
29572 29573
29622 29623
31133 31134
31186 31187
32740 32741
32801 32802
35240 35241
35293 35294
36800 36801
36852 36853
42543 42544
42599 42600

# insert into flights table

In [69]:
path = "D:/DE_classes/repos/Futurense-mysql/sql/Airline/tbl_flights_ev.csv"

flights = pd.read_csv(path,usecols=lambda x: x!= 'Unnamed: 0')
flights['status']=[1 for i in range(44716)]
#len(flights['FLIGHT_NUMBER'].unique())
# for idx,data in flights.iterrows():
#     try:
#         data = tuple(data)
#         cur.execute("insert into flight(flight_call,schedule_id,flight_status_id) values(%s,%s,%s)",data)
#     except:
#         print(idx)

In [ ]:
conn.commit()

In [155]:
flights

       FLIGHT_NUMBER  schedule_id  status
0               4685            1     NaN
1               5583            2     NaN
2               5187            3     NaN
3               5764            4     NaN
4               4557            5     NaN
...              ...          ...     ...
44711           6180        44712     NaN
44712           5742        44713     NaN
44713           4133        44714     NaN
44714           4651        44715     NaN
44715           5292        44716     NaN

[44716 rows x 3 columns]

# insert into bookings

In [68]:
path = "D:/DE_classes/repos/Futurense-mysql/sql/Airline/tbl_booking_ev.csv"
bookings = pd.read_csv(path,usecols=lambda x: x != 'Unnamed: 0')
for idx,data in bookings.iterrows():
    data = tuple((data[0],data[1],data[2],data[3],data[6],data[5]))
    cur.execute("insert into booking(client_id,flight_call,aircraft_id,seat_id,departure_date,seat_price) values(%s,%s,%s,%s,%s,%s)",data)
    
conn.commit()

DataError: 1264 (22003): Out of range value for column 'seat_price' at row 1

In [43]:
conn.close()

In [73]:
#schedule['depart_time']  =  str(pd.to_datetime(schedule['depart_time'],format='%H:%M')).split()[1]

In [7]:
cur.execute("Select * from aircraft")

IntegrityError: 1452 (23000): Cannot add or update a child row: a foreign key constraint fails (`flightdatabase`.`booking`, CONSTRAINT `fk_client_id_booking` FOREIGN KEY (`client_id`) REFERENCES `client` (`client_id`) ON DELETE CASCADE ON UPDATE CASCADE)

In [39]:
bookings

,client_id,flight_call,aircraft_id,seat_id,trvl_class,seat_price,date,distance
0,207950,4257,N10575,S74,E,51.7,2023-01-4,517
1,168950,3951,N10575,S50,E,80.9,2023-01-9,809
2,56906,4861,N10575,S7,B,51.7,2023-01-3,517
3,247438,4384,N10575,S77,E,80.9,2023-01-25,809
4,34883,3922,N10575,S115,E,80.9,2023-01-16,809
...,...,...,...,...,...,...,...,...
99995,215700,5435,N981EV,S36,B,43.3,2023-01-21,433
99996,128013,5042,N981EV,S164,E,31.4,2023-01-21,164
99997,32866,5306,N981EV,S81,E,39.1,2023-01-24,241
99998,278174,5042,N981EV,S126,E,30.2,2023-01-3,302
99999,214417,5313,N981EV,S234,E,31.7,2023-01-26,317